beber007/zottaos/ZottaOS/CORTEX-M3/STM32/ZottaOS_Interrupts.c
/* Copyright (c) 2006-2012 MIS Institute of the HEIG-VD affiliated to the University of
** Applied Sciences of Western Switzerland. All rights reserved.
** Permission to use, copy, modify, and distribute this software and its documentation
** for any purpose, without fee, and without written agreement is hereby granted, pro-
** vided that the above copyright notice, the following three sentences and the authors
** appear in all copies of this software and in the software where it is used.
** IN NO EVENT SHALL THE MIS INSTITUTE NOR THE HEIG-VD NOR THE UNIVERSITY OF APPLIED
** SCIENCES OF WESTERN SWITZERLAND BE LIABLE TO ANY PARTY FOR DIRECT, INDIRECT, SPECIAL,
** INCIDENTAL, OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OF THIS SOFTWARE AND ITS
** DOCUMENTATION, EVEN IF THE MIS INSTITUTE OR THE HEIG-VD OR THE UNIVERSITY OF APPLIED
** SCIENCES OF WESTERN SWITZERLAND HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
** THE MIS INSTITUTE, THE HEIG-VD AND THE UNIVERSITY OF APPLIED SCIENCES OF WESTERN SWIT-
** ZERLAND SPECIFICALLY DISCLAIMS ANY WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
** IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE SOFT-
** WARE PROVIDED HEREUNDER IS ON AN "AS IS" BASIS, AND THE MIS INSTITUTE NOR THE HEIG-VD
** AND NOR THE UNIVERSITY OF APPLIED SCIENCES OF WESTERN SWITZERLAND HAVE NO OBLIGATION
** TO PROVIDE MAINTENANCE, SUPPORT, UPDATES, ENHANCEMENTS, OR MODIFICATIONS.
*/
/* File ZottaOS_Interrupts.c:
** Platform version: All STM32 microcontrollers.
** Version date: March 2012
** Authors: MIS-TIC
*/

#include "ZottaOS.h"
#include "ZottaOS_Timer.h"


/* Table of devices used by the interrupt handler and the peripheral devices to obtain
** the appropriate I/O routine. */

/* Chaque entrées est initialisées NULL ou pointe sur un structure de type TIMERSELECT dans le
** cas ou l'entrée correspond à un vecteur ayant comme source plusieurs timer. TIMERSELECT
** est définit dans ZottaOS_Timer.h*/


/* static TIMERSELECT Timer9ISRSelect  = {_OSTimerSelector,{NULL,NULL},{0x40010000,0x40014000},0x80}; */


#if defined(STM32L151X6_X8_XB) || defined(STM32L152X6_X8_XB)
   void *_OSTabDevice[45] = {
      NULL, /* OS_IO_WWDG           0  Window WatchDog */
      NULL, /* OS_IO_PVD            1  PVD through EXTI Line detection */
      NULL, /* OS_IO_TAMP_STAMP     2  Tamper and TimeStamp through the EXTI line*/
      NULL, /* OS_IO_RTC_WKUP       3  RTC Wakeup through the EXTI line */
      NULL, /* OS_IO_FLASH          4  FLASH global */
      NULL, /* OS_IO_RCC            5  RCC global */
      NULL, /* OS_IO_EXTI0          6  EXTI Line0 */
      NULL, /* OS_IO_EXTI1          7  EXTI Line1 */
      NULL, /* OS_IO_EXTI2          8  EXTI Line2 */
      NULL, /* OS_IO_EXTI3          9  EXTI Line3 */
      NULL, /* OS_IO_EXTI4         10  EXTI Line4 */
      NULL, /* OS_IO_DMA1_Channel1 11  DMA1 Channel 1 global */
      NULL, /* OS_IO_DMA1_Channel2 12  DMA1 Channel 2 global */
      NULL, /* OS_IO_DMA1_Channel3 13  DMA1 Channel 3 global */
      NULL, /* OS_IO_DMA1_Channel4 14  DMA1 Channel 4 global */
      NULL, /* OS_IO_DMA1_Channel5 15  DMA1 Channel 5 global */
      NULL, /* OS_IO_DMA1_Channel6 16  DMA1 Channel 6 global */
      NULL, /* OS_IO_DMA1_Channel7 17  DMA1 Channel 7 global */
      NULL, /* OS_IO_ADC1          18  ADC1 global */
      NULL, /* OS_IO_USB_HP        19  USB High Priority */
      NULL, /* OS_IO_USB_LP        20  USB Low Priority */
      NULL, /* OS_IO_DAC           21  DAC */
      NULL, /* OS_IO_COMP          22  Comparator through EXTI Line  */
      NULL, /* OS_IO_EXTI9_5       23  External Line[9:5] */
      #if defined(STM32L152X6_X8_XB)
         NULL, /* OS_IO_LCD        24  LCD */
      #else
         NULL,
      #endif
      NULL, /* OS_IO_TIM9          25  TIM9 global */
      NULL, /* OS_IO_TIM10         26  TIM10 global */
      NULL, /* OS_IO_TIM11         27  TIM11 global */
      NULL, /* OS_IO_TIM2          28  TIM2 global */
      NULL, /* OS_IO_TIM3          29  TIM3 global */
      NULL, /* OS_IO_TIM4          30  TIM4 global */
      NULL, /* OS_IO_I2C1_EV       31  I2C1 Event */
      NULL, /* OS_IO_I2C1_ER       32  I2C1 Error */
      NULL, /* OS_IO_I2C2_EV       33  I2C2 Event */
      NULL, /* OS_IO_I2C2_ER       34  I2C2 Error */
      NULL, /* OS_IO_SPI1          35  SPI1 global */
      NULL, /* OS_IO_SPI2          36  SPI2 global */
      NULL, /* OS_IO_USART1        37  USART1 global */
      NULL, /* OS_IO_USART2        38  USART2 global */
      NULL, /* OS_IO_USART3        39  USART3 global */
      NULL, /* OS_IO_EXTI15_10     40  External Line[15:10]  */
      NULL, /* OS_IO_RTC_Alarm     41  RTC Alarm through EXTI Line */
      NULL, /* OS_IO_USB_FS_WKUP   42  USB FS WakeUp from suspend through EXTI Line */
      NULL, /* OS_IO_TIM6          43  TIM6 global */
      NULL  /* OS_IO_TIM7          44  TIM7 global */
   };
#elif defined(STM32L151XC) || defined(STM32L152XC) || defined(STM32L151XD) || \
      defined(STM32L152XD) || defined(STM32L162XD)
   void *_OSTabDevice[57] = {
      NULL, /* OS_IO_WWDG           0  Window WatchDog */
      NULL, /* OS_IO_PVD            1  PVD through EXTI Line detection */
      NULL, /* OS_IO_TAMP_STAMP     2  Tamper and TimeStamp through the EXTI line*/
      NULL, /* OS_IO_RTC_WKUP       3  RTC Wakeup through the EXTI line */
      NULL, /* OS_IO_FLASH          4  FLASH global */
      NULL, /* OS_IO_RCC            5  RCC global */
      NULL, /* OS_IO_EXTI0          6  EXTI Line0 */
      NULL, /* OS_IO_EXTI1          7  EXTI Line1 */
      NULL, /* OS_IO_EXTI2          8  EXTI Line2 */
      NULL, /* OS_IO_EXTI3          9  EXTI Line3 */
      NULL, /* OS_IO_EXTI4         10  EXTI Line4 */
      NULL, /* OS_IO_DMA1_Channel1 11  DMA1 Channel 1 global */
      NULL, /* OS_IO_DMA1_Channel2 12  DMA1 Channel 2 global */
      NULL, /* OS_IO_DMA1_Channel3 13  DMA1 Channel 3 global */
      NULL, /* OS_IO_DMA1_Channel4 14  DMA1 Channel 4 global */
      NULL, /* OS_IO_DMA1_Channel5 15  DMA1 Channel 5 global */
      NULL, /* OS_IO_DMA1_Channel6 16  DMA1 Channel 6 global */
      NULL, /* OS_IO_DMA1_Channel7 17  DMA1 Channel 7 global */
      NULL, /* OS_IO_ADC1          18  ADC1 global */
      NULL, /* OS_IO_USB_HP        19  USB High Priority */
      NULL, /* OS_IO_USB_LP        20  USB Low Priority */
      NULL, /* OS_IO_DAC           21  DAC */
      NULL, /* OS_IO_COMP_CA       22  Comparator and Channel acquisition through EXTI Line */
      NULL, /* OS_IO_EXTI9_5       23  External Line[9:5] */
      #if defined(STM32L152XC) || defined(STM32L152XD) || defined(STM32L162XD)
         NULL, /* OS_IO_LCD        24  LCD */
      #else
         NULL,
      #endif
      NULL, /* OS_IO_TIM9          25  TIM9 global */
      NULL, /* OS_IO_TIM10         26  TIM10 global */
      NULL, /* OS_IO_TIM11         27  TIM11 global */
      NULL, /* OS_IO_TIM2          28  TIM2 global */
      NULL, /* OS_IO_TIM3          29  TIM3 global */
      NULL, /* OS_IO_TIM4          30  TIM4 global */
      NULL, /* OS_IO_I2C1_EV       31  I2C1 Event */
      NULL, /* OS_IO_I2C1_ER       32  I2C1 Error */
      NULL, /* OS_IO_I2C2_EV       33  I2C2 Event */
      NULL, /* OS_IO_I2C2_ER       34  I2C2 Error */
      NULL, /* OS_IO_SPI1          35  SPI1 global */
      NULL, /* OS_IO_SPI2          36  SPI2 global */
      NULL, /* OS_IO_USART1        37  USART1 global */
      NULL, /* OS_IO_USART2        38  USART2 global */
      NULL, /* OS_IO_USART3        39  USART3 global */
      NULL, /* OS_IO_EXTI15_10     40  External Line[15:10]  */
      NULL, /* OS_IO_RTC_Alarm     41  RTC Alarm through EXTI Line */
      NULL, /* OS_IO_USB_FS_WKUP   42  USB FS WakeUp from suspend through EXTI Line */
      NULL, /* OS_IO_TIM6          43  TIM6 global */
      NULL, /* OS_IO_TIM7          44  TIM7 global */
      #if defined(STM32L151XD) || defined(STM32L152XD) || defined(STM32L162XD)
         NULL, /* OS_IO_SDIO       45  SDIO global */
      #else
         NULL,
      #endif
      NULL, /* OS_IO_TIM5          46  TIM5 global */
      NULL, /* OS_IO_SPI3          47  SPI3 global */
      #if defined(STM32L151XD) || defined(STM32L152XD) || defined(STM32L162XD)
         NULL, /* OS_IO_UART4      48  UART4 global */
         NULL, /* OS_IO_UART5      49  UART5 global */
      #else
         NULL,
         NULL,
      #endif
      NULL, /* OS_IO_DMA2_Channel1 50  DMA2 Channel 1 global */
      NULL, /* OS_IO_DMA2_Channel2 51  DMA2 Channel 2 global */
      NULL, /* OS_IO_DMA2_Channel3 52  DMA2 Channel 3 global */
      NULL, /* OS_IO_DMA2_Channel4 53  DMA2 Channel 4 global */
      NULL, /* OS_IO_DMA2_Channel5 54  DMA2 Channel 5 global */
      #if defined(STM32L162XD)
         NULL, /* OS_IO_AES        55  AES global */
      #else
         NULL,
      #endif
      NULL , /* OS_IO_COMP_ACQ 56  Comparator Channel Acquisition global */
   };
#elif defined(STM32F101T8_TB) || defined(STM32F101C8_CB_R8_RB_V8_VB) || \
      defined(STM32F101X4_X6)
   void *_OSTabDevice[42] = {
      NULL, /* OS_IO_WWDG           0 Window WatchDog */
      NULL, /* OS_IO_PVD            1 PVD through EXTI Line detection */
      NULL, /* OS_IO_TAMPER         2 Tamper */
      NULL, /* OS_IO_RTC            3 RTC global */
      NULL, /* OS_IO_FLASH          4 FLASH global */
      NULL, /* OS_IO_RCC            5 RCC global */
      NULL, /* OS_IO_EXTI0          6 EXTI Line0 */
      NULL, /* OS_IO_EXTI1          7 EXTI Line1 */
      NULL, /* OS_IO_EXTI2          8 EXTI Line2 */
      NULL, /* OS_IO_EXTI3          9 EXTI Line3 */
      NULL, /* OS_IO_EXTI4         10 EXTI Line4 */
      NULL, /* OS_IO_DMA1_Channel1 11 DMA1 Channel 1 global */
      NULL, /* OS_IO_DMA1_Channel2 12 DMA1 Channel 2 global */
      NULL, /* OS_IO_DMA1_Channel3 13 DMA1 Channel 3 global */
      NULL, /* OS_IO_DMA1_Channel4 14 DMA1 Channel 4 global */
      NULL, /* OS_IO_DMA1_Channel5 15 DMA1 Channel 5 global */
      NULL, /* OS_IO_DMA1_Channel6 16 DMA1 Channel 6 global */
      NULL, /* OS_IO_DMA1_Channel7 17 DMA1 Channel 7 global */
      NULL, /* OS_IO_ADC1          18 ADC1 global */
      NULL,
      NULL,
      NULL,
      NULL,
      NULL, /* OS_IO_EXTI9_5       23 External Line[9:5] */
      NULL,
      NULL,
      NULL,
      NULL,
      NULL, /* OS_IO_TIM2          28  TIM2 global */
      NULL, /* OS_IO_TIM3          29  TIM3 global */
      #if defined(STM32F101T8_TB) || defined(STM32F101C8_CB_R8_RB_V8_VB)
         NULL, /* OS_IO_TIM4       30 TIM4 global */
      #else
         NULL,
      #endif
      NULL, /* OS_IO_I2C1_EV       31 I2C1 Event */
      NULL, /* OS_IO_I2C1_ER       32 I2C1 Error */
      #if defined(STM32F101C8_CB_R8_RB_V8_VB)
         NULL, /* OS_IO_I2C2_EV    33 I2C2 Event */
         NULL, /* OS_IO_I2C2_ER    34 I2C2 Error */
      #else
         NULL,
         NULL,
      #endif
      NULL, /* OS_IO_SPI1          35 SPI1 global */
      #if defined(STM32F101C8_CB_R8_RB_V8_VB)
         NULL, /* OS_IO_SPI2       36 SPI2 global */
      #else
         NULL,
      #endif
      NULL, /* OS_IO_USART1        37 USART1 global */
      NULL, /* OS_IO_USART2        38 USART2 global */
      #if defined(STM32F101C8_CB_R8_RB_V8_VB)
         NULL, /* OS_IO_USART3     39 USART3 global */
      #else
         NULL,
      #endif
      NULL, /* OS_IO_EXTI15_10     40 External Line[15:10] */
      NULL  /* OS_IO_RTCAlarm      41 RTC Alarm through EXTI Line */
   };
#elif defined(STM32F103X4_X6) || defined(STM32F103T8_TB) || \
      defined(STM32F103C8_CB_R8_RB_V8_VB) || defined(STM32F102X4_X6) || \
      defined(STM32F102X8_XB)
   void *_OSTabDevice[43] = {
      NULL, /* OS_IO_WWDG             0 Window WatchDog */
      NULL, /* OS_IO_PVD              1 PVD through EXTI Line detection */
      NULL, /* OS_IO_TAMPER           2 Tamper */
      NULL, /* OS_IO_RTC              3 RTC global */
      NULL, /* OS_IO_FLASH            4 FLASH global */
      NULL, /* OS_IO_RCC              5 RCC global */
      NULL, /* OS_IO_EXTI0            6 EXTI Line0 */
      NULL, /* OS_IO_EXTI1            7 EXTI Line1 */
      NULL, /* OS_IO_EXTI2            8 EXTI Line2 */
      NULL, /* OS_IO_EXTI3            9 EXTI Line3 */
      NULL, /* OS_IO_EXTI4           10 EXTI Line4 */
      NULL, /* OS_IO_DMA1_Channel1   11 DMA1 Channel 1 global */
      NULL, /* OS_IO_DMA1_Channel2   12 DMA1 Channel 2 global */
      NULL, /* OS_IO_DMA1_Channel3   13 DMA1 Channel 3 global */
      NULL, /* OS_IO_DMA1_Channel4   14 DMA1 Channel 4 global */
      NULL, /* OS_IO_DMA1_Channel5   15 DMA1 Channel 5 global */
      NULL, /* OS_IO_DMA1_Channel6   16 DMA1 Channel 6 global */
      NULL, /* OS_IO_DMA1_Channel7   17 DMA1 Channel 7 global */
      NULL, /* OS_IO_ADC1            18 ADC1 global */
      NULL,
      #if defined(STM32F103X4_X6) || defined(STM32F103T8_TB) || \
          defined(STM32F103C8_CB_R8_RB_V8_VB)
         NULL, /* OS_IO_USB_HP_CAN1_TX 19 USB Device High Priority or CAN1 TX */
      #elif defined(STM32F102X4_X6) || defined(STM32F102X8_XB)
         NULL, /* OS_IO_USB_HP         19 USB Device High Priority */
      #endif
      #if defined(STM32F103X4_X6) || defined(STM32F103T8_TB) || \
         NULL, /* OS_IO_USB_LP_CAN1_RX0 20 USB Device Low Priority or CAN1 RX0 */
      #elif defined(STM32F102X4_X6) || defined(STM32F102X8_XB)
         NULL, /* OS_IO_USB_LP          20 USB Device Low Priority */
      #else
         NULL,
      #endif
      #if defined(STM32F103X4_X6) || defined(STM32F103T8_TB) || \
          defined(STM32F103C8_CB_R8_RB_V8_VB)
         NULL, /* OS_IO_CAN1_RX1     21 CAN1 RX1 */
      #else
         NULL,
      #endif
      #if defined(STM32F103X4_X6) || defined(STM32F103T8_TB) || \
          defined(STM32F103C8_CB_R8_RB_V8_VB)
         NULL, /* OS_IO_CAN1_SCE     22 CAN1 SCE */
      #else
         NULL,
      #endif
      NULL, /* OS_IO_EXTI9_5         23 External Line[9:5] */
      #if defined(STM32F103X4_X6) || defined(STM32F103T8_TB) || \
          defined(STM32F103C8_CB_R8_RB_V8_VB)
         NULL, /* OS_IO_TIM1_BRK     24 TIM1 Break */
         NULL, /* OS_IO_TIM1_UP      25 TIM1 Update */
         NULL, /* OS_IO_TIM1_TRG_COM 26 TIM1 Trigger and Commutation */
         NULL, /* OS_IO_TIM1_CC      27 TIM1 Capture Compare */
      #else
         NULL,
         NULL,
         NULL,
         NULL,
      #endif
      NULL, /* OS_IO_TIM2            28 TIM2 global */
      NULL, /* OS_IO_TIM3            29 TIM3 global */
      #if defined(STM32F102X8_XB) || defined(STM32F103T8_TB) || \
          defined(STM32F103C8_CB_R8_RB_V8_VB)
         NULL, /* OS_IO_TIM4         30 TIM4 global */
      #else
         NULL,
      #endif
      NULL, /* OS_IO_I2C1_EV         31 I2C1 Event */
      NULL, /* OS_IO_I2C1_ER         32 I2C1 Error */
      #if defined(STM32F102X8_XB) || defined(STM32F103C8_CB_R8_RB_V8_VB)
         NULL, /* OS_IO_I2C2_EV      33 I2C2 Event */
         NULL, /* OS_IO_I2C2_ER      34 I2C2 Error */
      #else
         NULL,
         NULL,
      #endif
      NULL, /* OS_IO_SPI1            35 SPI1 global */
      #if defined(STM32F102X8_XB) || defined(STM32F103C8_CB_R8_RB_V8_VB) || \
         NULL, /* OS_IO_SPI2         36 SPI2 global */
      #else
        NULL,
      #endif
      NULL, /* OS_IO_USART1          37 USART1 global */
      NULL, /* OS_IO_USART2          38 USART2 global */
      #if defined(STM32F102X8_XB) || defined(STM32F103C8_CB_R8_RB_V8_VB) || \
         NULL, /* OS_IO_USART3       39 USART3 global */
      #else
         NULL,
      #endif
      NULL, /* OS_IO_EXTI15_10       40 External Line[15:10] */
      NULL, /* OS_IO_RTCAlarm        41 RTC Alarm through EXTI Line */
      NULL  /* OS_IO_USBWakeUp       42 USB Device WakeUp from suspend through EXTI Line */
   };
#elif defined(STM32F100X4_X6) || defined(STM32F100X8_XB)
   static TIMERSELECT Timer15ISRSelect = {_OSTimerSelectorHandler,{NULL,NULL},{0x40012C00,0x40014000},0x80};
   static TIMERSELECT Timer16ISRSelect = {_OSTimerSelectorHandler,{NULL,NULL},{0x40012C00,0x40014400},0x01};
   static TIMERSELECT Timer17ISRSelect = {_OSTimerSelectorHandler,{NULL,NULL},{0x40012C00,0x40014800},0x40};
   void *_OSTabDevice[56] = {
      NULL, /* OS_IO_WWDG             0 Window WatchDog */
      NULL, /* OS_IO_PVD              1 PVD through EXTI Line detection */
      NULL, /* OS_IO_TAMPER           2 Tamper */
      NULL, /* OS_IO_RTC              3 RTC global */
      NULL, /* OS_IO_FLASH            4 FLASH global */
      NULL, /* OS_IO_RCC              5 RCC global */
      NULL, /* OS_IO_EXTI0            6 EXTI Line0 */
      NULL, /* OS_IO_EXTI1            7 EXTI Line1 */
      NULL, /* OS_IO_EXTI2            8 EXTI Line2 */
      NULL, /* OS_IO_EXTI3            9 EXTI Line3 */
      NULL, /* OS_IO_EXTI4           10 EXTI Line4 */
      NULL, /* OS_IO_DMA1_Channel1   11 DMA1 Channel 1 global */
      NULL, /* OS_IO_DMA1_Channel2   12 DMA1 Channel 2 global */
      NULL, /* OS_IO_DMA1_Channel3   13 DMA1 Channel 3 global */
      NULL, /* OS_IO_DMA1_Channel4   14 DMA1 Channel 4 global */
      NULL, /* OS_IO_DMA1_Channel5   15 DMA1 Channel 5 global */
      NULL, /* OS_IO_DMA1_Channel6   16 DMA1 Channel 6 global */
      NULL, /* OS_IO_DMA1_Channel7   17 DMA1 Channel 7 global */
      NULL, /* OS_IO_ADC1            18 ADC1 global */
      NULL,
      NULL,
      NULL,
      NULL,
      NULL, /* OS_IO_EXTI9_5         23 External Line[9:5] */
      Timer15ISRSelect, /* OS_IO_TIM1_BRK_TIM15     24 TIM1 Break and TIM15 */
      Timer16ISRSelect, /* OS_IO_TIM1_UP_TIM16      25 TIM1 Update and TIM16 */
      Timer17ISRSelect, /* OS_IO_TIM1_TRG_COM_TIM17 26 TIM1 Trigger and Commutation and TIM17 */
      NULL, /* OS_IO_TIM1_CC         27 TIM1 Capture Compare */
      NULL, /* OS_IO_TIM2            28  TIM2 global */
      NULL, /* OS_IO_TIM3            29  TIM3 global */
      #if defined (STM32F100X8_XB)
         NULL, /* OS_IO_TIM4         30 TIM4 global */
      #else
         NULL,
      #endif
      NULL, /* OS_IO_I2C1_EV         31 I2C1 Event */
      NULL, /* OS_IO_I2C1_ER         32 I2C1 Error */
      #if defined(STM32F100X8_XB)
         NULL, /* OS_IO_I2C2_EV      33 I2C2 Event */
         NULL, /* OS_IO_I2C2_ER      34 I2C2 Error */
      #else
         NULL,
         NULL,
      #endif
         NULL, /* OS_IO_SPI1         35 SPI1 global */
      #if defined(STM32F100X8_XB)
         NULL, /* OS_IO_SPI2         36 SPI2 global */
      #else
         NULL,
      #endif
      NULL, /* OS_IO_USART1          37 USART1 global */
      NULL, /* OS_IO_USART2          38 USART2 global */
      #if defined(STM32F100X8_XB)
          NULL, /* OS_IO_USART3      39 USART3 global */
      #else
          NULL,
      #endif
      NULL, /* OS_IO_EXTI15_10       40 External Line[15:10] */
      NULL, /* OS_IO_RTCAlarm        41 RTC Alarm through EXTI Line */
      NULL, /* OS_IO_CEC             42 HDMI-CEC */
      NULL,
      NULL,
      NULL,
      NULL,
      NULL,
      NULL,
      NULL,
      NULL,
      NULL,
      NULL,
      NULL,
      NULL, /* OS_IO_TIM6_DAC        54 TIM6 and DAC underrun */
      NULL, /* OS_IO_TIM7            55 TIM7 */
   };
#elif defined(STM32F101RC_RD_RE) || defined(STM32F101VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F101RF_RG) || defined(STM32F101VF_VG_ZF_ZG) || \
      defined(STM32F103RC_RD_RE) || defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F103RF_RG) || defined(STM32F103VF_VG_ZF_ZG)
   #if defined(STM32F103RF_RG) || defined(STM32F103VF_VG_ZF_ZG)
      static TIMERSELECT Timer9ISRSelect  = {_OSTimerSelectorHandler,{NULL,NULL},{0x40012C00,0x40014C00},0x80};
      static TIMERSELECT Timer10ISRSelect = {_OSTimerSelectorHandler,{NULL,NULL},{0x40012C00,0x40015000},0x01};
      static TIMERSELECT Timer11ISRSelect = {_OSTimerSelectorHandler,{NULL,NULL},{0x40012C00,0x40015400},0x40};
      static TIMERSELECT Timer12ISRSelect = {_OSTimerSelectorHandler,{NULL,NULL},{0x40013400,0x40001800},0x80};
      static TIMERSELECT Timer13ISRSelect = {_OSTimerSelectorHandler,{NULL,NULL},{0x40013400,0x40001C00},0x01};
      static TIMERSELECT Timer14ISRSelect = {_OSTimerSelectorHandler,{NULL,NULL},{0x40013400,0x40002000},0x40};
   #endif
   void *_OSTabDevice[60] = {
      NULL, /* OS_IO_WWDG             0 Window WatchDog */
      NULL, /* OS_IO_PVD              1 PVD through EXTI Line detection */
      NULL, /* OS_IO_TAMPER           2 Tamper */
      NULL, /* OS_IO_RTC              3 RTC global */
      NULL, /* OS_IO_FLASH            4 FLASH global */
      NULL, /* OS_IO_RCC              5 RCC global */
      NULL, /* OS_IO_EXTI0            6 EXTI Line0 */
      NULL, /* OS_IO_EXTI1            7 EXTI Line1 */
      NULL, /* OS_IO_EXTI2            8 EXTI Line2 */
      NULL, /* OS_IO_EXTI3            9 EXTI Line3 */
      NULL, /* OS_IO_EXTI4           10 EXTI Line4 */
      NULL, /* OS_IO_DMA1_Channel1   11 DMA1 Channel 1 global */
      NULL, /* OS_IO_DMA1_Channel2   12 DMA1 Channel 2 global */
      NULL, /* OS_IO_DMA1_Channel3   13 DMA1 Channel 3 global */
      NULL, /* OS_IO_DMA1_Channel4   14 DMA1 Channel 4 global */
      NULL, /* OS_IO_DMA1_Channel5   15 DMA1 Channel 5 global */
      NULL, /* OS_IO_DMA1_Channel6   16 DMA1 Channel 6 global */
      NULL, /* OS_IO_DMA1_Channel7   17 DMA1 Channel 7 global */
      NULL, /* OS_IO_ADC1            18 ADC1 global */
      NULL, /* OS_IO_USB_HP_CAN1_TX  19 USB Device High Priority or CAN1 TX */
      NULL, /* OS_IO_USB_LP_CAN1_RX0 20 USB Device Low Priority or CAN1 RX0 */
      NULL, /* OS_IO_CAN1_RX1        21 CAN1 RX1 */
      NULL, /* OS_IO_CAN1_SCE        22 CAN1 SCE */
      NULL, /* OS_IO_EXTI9_5         23 External Line[9:5] */
      #if defined(STM32F103RC_RD_RE) || defined(STM32F103VC_VD_VE_ZC_ZD_ZE)
         NULL, /* OS_IO_TIM1_BRK     24 TIM1 Break */
         NULL, /* OS_IO_TIM1_UP      25 TIM1 Update */
         NULL, /* OS_IO_TIM1_TRG_COM 26 TIM1 Trigger and Commutation */
         NULL, /* OS_IO_TIM1_CC      27 TIM1 Capture Compare */
      #elif defined (STM32F101RF_RG)|| defined(STM32F101VF_VG_ZF_ZG)
         NULL, /* OS_IO_TIM9         24 TIM9 global */
         NULL, /* OS_IO_TIM10        25 TIM10 global */
         NULL, /* OS_IO_TIM11        26 TIM11 */
         NULL,
      #elif defined(STM32F103RF_RG) || defined(STM32F103VF_VG_ZF_ZG)
         Timer9ISRSelect,  /* OS_IO_TIM1_BRK_TIM9      24 TIM1 Break  and TIM9 global */
         Timer10ISRSelect, /* OS_IO_TIM1_UP_TIM10      25 TIM1 Update and TIM10 global */
         Timer11ISRSelect, /* OS_IO_TIM1_TRG_COM_TIM11 26 TIM1 Trigger and Commutation  and TIM11 */
         NULL, /* OS_IO_TIM1_CC      27 TIM1 Capture Compare */
      #else
         NULL,
         NULL,
         NULL,
         NULL,
      #endif
      NULL, /* OS_IO_TIM2            28  TIM2 global */
      NULL, /* OS_IO_TIM3            29  TIM3 global */
      NULL, /* OS_IO_TIM4            30 TIM4 global */
      NULL, /* OS_IO_I2C1_EV         31 I2C1 Event */
      NULL, /* OS_IO_I2C1_ER         32 I2C1 Error */
      NULL, /* OS_IO_I2C2_EV         33 I2C2 Event */
      NULL, /* OS_IO_I2C2_ER         34 I2C2 Error */
      NULL, /* OS_IO_SPI1            35 SPI1 global */
      NULL, /* OS_IO_SPI2            36 SPI2 global */
      NULL, /* OS_IO_USART1          37 USART1 global */
      NULL, /* OS_IO_USART2          38 USART2 global */
      NULL, /* OS_IO_USART3          39 USART3 global */
      NULL, /* OS_IO_EXTI15_10       40 External Line[15:10] */
